zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_adc_ex.h
  FunctionalState InjectedOffsetSignedSaturation;  /*!< Specifies whether the Signed saturation feature is used or not.
                                                        This parameter is applied only for 14-bit or 8-bit resolution.
                                                        This parameter can be set to ENABLE or DISABLE. */

  uint32_t InjectedOffsetSign;            /*!< Define if the offset should be subtracted (negative sign) or added
                                               (positive sign) from or to the raw converted data.
                                               This parameter can be a value of @ref ADCEx_OffsetSign.
                                               Note:
                                                 - This parameter must be modified when no conversion is on
                                                   going on both regular and injected groups (ADC disabled,
                                                   or ADC enabled without continuous mode or external trigger
                                                   that could launch a conversion).
                                                 - This parameter is specific to ADC1 only. */

  FunctionalState InjectedOffsetSaturation;   /*!< Define if the offset should be saturated upon under or over flow.
                                               This parameter value can be ENABLE or DISABLE.
                                               Note: This parameter must be modified when no conversion is on
                                                     going on both regular and injected groups (ADC disabled,
                                                     or ADC enabled without continuous mode or external trigger
                                                     that could launch a conversion). */

  uint32_t InjectedLeftBitShift;          /*!< Configures the left shifting applied to the final result with or without
                                               oversampling.
                                              This parameter can be a value of @ref ADCEx_Left_Bit_Shift */

  uint32_t InjectedNbrOfConversion;       /*!< Specifies the number of ranks that will be converted within
                                               the ADC group injected sequencer.
                                               To use the injected group sequencer and convert several ranks,
                                               parameter 'ScanConvMode' must be enabled.
                                               This parameter must be a number between Min_Data = 1 and Max_Data = 4.
                                               Caution: this setting impacts the entire injected group.
                                                        Therefore, call of HAL_ADCEx_InjectedConfigChannel() to
                                                        configure a channel on injected group can impact the
                                                        configuration of other channels previously set. */

  FunctionalState InjectedDiscontinuousConvMode; /*!< Specifies whether the conversions sequence of ADC group injected
                                                      is performed in Complete-sequence/Discontinuous-sequence
                                                      (main sequence subdivided in successive parts).
                                                      Discontinuous mode is used only if sequencer is enabled
                                                      (parameter 'ScanConvMode').
                                                      If sequencer is disabled, this parameter is discarded.
                                                      Discontinuous mode can be enabled only if continuous
                                                      mode is disabled.
                                                      This parameter can be set to ENABLE or DISABLE.
                                                      Note: This parameter must be modified when ADC is disabled
                                                           (before ADC start conversion or after ADC stop conversion).
                                                      Note: For injected group, discontinuous mode converts the
                                                            sequence channel by channel (discontinuous length
                                                            fixed to 1 rank).
                                                      Caution: this setting impacts the entire injected group.
                                                               Therefore, call of HAL_ADCEx_InjectedConfigChannel() to
                                                               configure a channel on injected group can impact the
                                                               configuration of other channels previously set. */

  FunctionalState AutoInjectedConv;       /*!< Enables or disables the selected ADC group injected automatic conversion
                                               after regular one
                                               This parameter can be set to ENABLE or DISABLE.
                                               Note: To use Automatic injected conversion, discontinuous mode
                                                     must be disabled ('DiscontinuousConvMode' and
                                                     'InjectedDiscontinuousConvMode' set to DISABLE)
                                               Note: To use Automatic injected conversion, injected group
                                                     external triggers must be disabled
                                                     ('ExternalTrigInjecConv' set to ADC_INJECTED_SOFTWARE_START)
                                               Note: In case of DMA used with regular group: if DMA configured in normal
                                                     mode (single shot) JAUTO will be stopped upon DMA
                                                     transfer complete. To maintain JAUTO always enabled,
                                                     DMA must be configured in circular mode.
                                               Caution: this setting impacts the entire injected group.
                                                        Therefore, call of HAL_ADCEx_InjectedConfigChannel() to
                                                        configure a channel on injected group can impact the
                                                        configuration of other channels previously set. */

  uint32_t ExternalTrigInjecConv;         /*!< Selects the external event used to trigger the conversion start of
                                               injected group.
                                               If set to ADC_INJECTED_SOFTWARE_START, external triggers are disabled
                                               and software trigger is used instead.
                                               This parameter can be a value of
                                               @ref ADC_injected_external_trigger_source.
                                               Caution: this setting impacts the entire injected group. Therefore,
                                                        call of HAL_ADCEx_InjectedConfigChannel() to configure a
                                                        channel on injected group can impact the configuration of
                                                        other channels previously set. */

