zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_adc_ex.h
  uint32_t ExternalTrigInjecConvEdge;     /*!< Selects the external trigger edge of injected group.
                                               This parameter can be a value of @ref ADC_injected_external_trigger_edge.
                                               If trigger source is set to ADC_INJECTED_SOFTWARE_START, this parameter
                                               is discarded.
                                               Caution: this setting impacts the entire injected group.
                                                        Therefore, call of HAL_ADCEx_InjectedConfigChannel()
                                                        to configure a channel on injected group can impact the
                                                        configuration of other channels previously set. */

  FunctionalState InjecOversamplingMode;        /*!< Specifies whether the oversampling feature is enabled or disabled.
                                                     This parameter can be set to ENABLE or DISABLE.
                                                     Note: This parameter can be modified only if there is
                                                           no conversion is ongoing (both ADSTART and JADSTART
                                                           cleared). */

  ADC_InjOversamplingTypeDef  InjecOversampling; /*!< Specifies the Oversampling parameters.
                                                      Caution: this setting overwrites the previous oversampling
                                                               configuration if oversampling already enabled.
                                                      Note: This parameter can be modified only if there is no
                                                            conversion is ongoing (both ADSTART and
                                                            JADSTART cleared).*/
} ADC_InjectionConfTypeDef;

#if defined(ADC_MULTIMODE_SUPPORT)
/**
  * @brief  Structure definition of ADC multimode
  * @note   The setting of these parameters by function HAL_ADCEx_MultiModeConfigChannel() is conditioned by ADCs
  *         state (both Master and Slave ADCs).
  *         Both Master and Slave ADCs must be disabled.
  */
typedef struct
{
  uint32_t Mode;              /*!< Configures the ADC to operate in independent or multimode.
                                   This parameter can be a value of @ref ADC_HAL_EC_MULTI_MODE. */

  uint32_t DualModeData;      /*!< Configures the Dual ADC Mode Data Format:
                                   This parameter can be a value of @ref ADCEx_Dual_Mode_Data_Format */

  uint32_t TwoSamplingDelay;  /*!< Configures the Delay between 2 sampling phases.
                                   This parameter can be a value of @ref ADC_HAL_EC_MULTI_TWOSMP_DELAY.
                                   Delay range depends on selected resolution:
                                    from 1 to 12 clock cycles for 12 bits, from 1 to 10 clock cycles for 10 bits,
                                    from 1 to 8 clock cycles for 8 bits, from 1 to 6 clock cycles for 6 bits.     */
} ADC_MultiModeTypeDef;
#endif /* ADC_MULTIMODE_SUPPORT */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup ADCEx_Exported_Constants ADC Extended Exported Constants
  * @{
  */

/** @defgroup ADC_injected_external_trigger_source ADC group injected trigger source
  * @{
  */
/* ADC group regular trigger sources for all ADC instances */
#define ADC_INJECTED_SOFTWARE_START         (LL_ADC_INJ_TRIG_SOFTWARE)           /*!< Software triggers injected group conversion start */
#define ADC_EXTERNALTRIGINJEC_T1_TRGO       (LL_ADC_INJ_TRIG_EXT_TIM1_TRGO)      /*!< ADC group injected conversion trigger from external peripheral: TIM1 TRGO event.  Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T1_TRGO2      (LL_ADC_INJ_TRIG_EXT_TIM1_TRGO2)     /*!< ADC group injected conversion trigger from external peripheral: TIM1 TRGO2 event. Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T8_TRGO       (LL_ADC_INJ_TRIG_EXT_TIM8_TRGO)      /*!< ADC group injected conversion trigger from external peripheral: TIM8 TRGO event.  Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T8_TRGO2      (LL_ADC_INJ_TRIG_EXT_TIM8_TRGO2)     /*!< ADC group injected conversion trigger from external peripheral: TIM8 TRGO2 event. Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T20_TRGO      (LL_ADC_INJ_TRIG_EXT_TIM20_TRGO)     /*!< ADC group injected conversion trigger from external peripheral: TIM20 TRGO event. Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T20_TRGO2     (LL_ADC_INJ_TRIG_EXT_TIM20_TRGO2)    /*!< ADC group injected conversion trigger from external peripheral: TIM20 TRGO2 event.Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T2_TRGO       (LL_ADC_INJ_TRIG_EXT_TIM2_TRGO)      /*!< ADC group injected conversion trigger from external peripheral: TIM2 TRGO event.  Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T3_TRGO       (LL_ADC_INJ_TRIG_EXT_TIM3_TRGO)      /*!< ADC group injected conversion trigger from external peripheral: TIM3 TRGO event.  Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T4_TRGO       (LL_ADC_INJ_TRIG_EXT_TIM4_TRGO)      /*!< ADC group injected conversion trigger from external peripheral: TIM4 TRGO event.  Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T5_TRGO       (LL_ADC_INJ_TRIG_EXT_TIM5_TRGO)      /*!< ADC group injected conversion trigger from external peripheral: TIM5 TRGO event.  Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T6_TRGO       (LL_ADC_INJ_TRIG_EXT_TIM6_TRGO)      /*!< ADC group injected conversion trigger from external peripheral: TIM6 TRGO event.  Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T7_TRGO       (LL_ADC_INJ_TRIG_EXT_TIM7_TRGO)      /*!< ADC group injected conversion trigger from external peripheral: TIM7 TRGO event.  Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T15_TRGO      (LL_ADC_INJ_TRIG_EXT_TIM15_TRGO)     /*!< ADC group injected conversion trigger from external peripheral: TIM15 TRGO event. Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T16_CC1       (LL_ADC_INJ_TRIG_EXT_TIM16_CC1)      /*!< ADC group injected conversion trigger from external peripheral: TIM16 channel 1 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T1_CC3_ADC12  (LL_ADC_INJ_TRIG_EXT_TIM1_CC3_ADC12) /*!< ADC group injected conversion trigger from external peripheral: TIM1  channel 3 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T8_CC1        (LL_ADC_INJ_TRIG_EXT_TIM8_CC1)       /*!< ADC group injected conversion trigger from external peripheral: TIM8  channel 1 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T20_CC1       (LL_ADC_INJ_TRIG_EXT_TIM20_CC1)      /*!< ADC group injected conversion trigger from external peripheral: TIM20 channel 1 event.(capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T2_CC1        (LL_ADC_INJ_TRIG_EXT_TIM2_CC1)       /*!< ADC group injected conversion trigger from external peripheral: TIM2  channel 1 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T2_CC3        (LL_ADC_INJ_TRIG_EXT_TIM2_CC3)       /*!< ADC group injected conversion trigger from external peripheral: TIM2  channel 3 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T3_CC1        (LL_ADC_INJ_TRIG_EXT_TIM3_CC1)       /*!< ADC group injected conversion trigger from external peripheral: TIM3  channel 1 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T4_CC1        (LL_ADC_INJ_TRIG_EXT_TIM4_CC1)       /*!< ADC group injected conversion trigger from external peripheral: TIM4  channel 1 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T5_CC3        (LL_ADC_INJ_TRIG_EXT_TIM5_CC3)       /*!< ADC group injected conversion trigger from external peripheral: TIM5  channel 3 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T12_CC1       (LL_ADC_INJ_TRIG_EXT_TIM12_CC1)      /*!< ADC group injected conversion trigger from external peripheral: TIM12 channel 1 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_EXT_IT15      (LL_ADC_INJ_TRIG_EXT_EXTI_LINE15)    /*!< ADC group injected conversion trigger from external peripheral: external interrupt line 15. Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_LPTIM1_CH2    (LL_ADC_INJ_TRIG_EXT_LPTIM1_CH2)     /*!< ADC group injected conversion trigger from external peripheral: LPTIM1 channel 2 event. Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_LPTIM2_CH2    (LL_ADC_INJ_TRIG_EXT_LPTIM2_CH2)     /*!< ADC group injected conversion trigger from external peripheral: LPTIM2 channel 2 event. Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_LPTIM3_CH1    (LL_ADC_INJ_TRIG_EXT_LPTIM3_CH1)     /*!< ADC group injected conversion trigger from external peripheral: LPTIM3 channel 1 event. Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_LPTIM4_CH1    (LL_ADC_INJ_TRIG_EXT_LPTIM4_CH1)     /*!< ADC group injected conversion trigger from external peripheral: LPTIM4 channel 1 event. Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_LPTIM5_OUT    (LL_ADC_INJ_TRIG_EXT_LPTIM5_OUT)     /*!< ADC group injected conversion trigger from external peripheral: LPTIM5 OUT event.       Trigger edge set to rising edge (default setting). */

#define ADC_EXTERNALTRIGINJEC_T1_CC3_ADC3   (LL_ADC_INJ_TRIG_EXT_TIM1_CC3_ADC3)  /*!< ADC group injected conversion trigger from external peripheral: TIM1 channel 4 event  (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T1_CC4        (LL_ADC_INJ_TRIG_EXT_TIM1_CC4)       /*!< ADC group injected conversion trigger from external peripheral: TIM8 channel 2 event  (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T8_CC2        (LL_ADC_INJ_TRIG_EXT_TIM8_CC2)       /*!< ADC group injected conversion trigger from external peripheral: TIM8 channel 4 event  (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T8_CC4        (LL_ADC_INJ_TRIG_EXT_TIM8_CC4)       /*!< ADC group injected conversion trigger from external peripheral: TIM8 channel 4 event  (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T20_CC2       (LL_ADC_INJ_TRIG_EXT_TIM20_CC2)      /*!< ADC group injected conversion trigger from external peripheral: TIM20 channel 2 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T4_CC3        (LL_ADC_INJ_TRIG_EXT_TIM4_CC3)       /*!< ADC group injected conversion trigger from external peripheral: TIM4 channel 3 event  (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T4_CC4        (LL_ADC_INJ_TRIG_EXT_TIM4_CC4)       /*!< ADC group injected conversion trigger from external peripheral: TIM4 channel 4 event  (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T5_CC1        (LL_ADC_INJ_TRIG_EXT_TIM5_CC1)       /*!< ADC group injected conversion trigger from external peripheral: TIM5 channel 1 event  (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T12_CC2       (LL_ADC_INJ_TRIG_EXT_TIM12_CC2)      /*!< ADC group injected conversion trigger from external peripheral: TIM12 channel 2 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_T15_CC1       (LL_ADC_INJ_TRIG_EXT_TIM15_CC1)      /*!< ADC group injected conversion trigger from external peripheral: TIM15 channel 1 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC_EXTERNALTRIGINJEC_EXT_IT3       (LL_ADC_INJ_TRIG_EXT_EXTI_LINE3)     /*!< ADC group injected conversion trigger from external peripheral: external interrupt line 3. Trigger edge set to rising edge (default setting). */
/**
  * @}
  */

