zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_adc_ex.h
#define ADC_INDEPENDENT_OR_NONMULTIMODEINJECTED_SLAVE(__HANDLE__)          \
  ( ( ((__HANDLE__)->Instance == ADC1) || ((__HANDLE__)->Instance == ADC3) \
    )?                                                                     \
    SET                                                                    \
    :                                                                      \
    ( ((ADC12_COMMON->CCR & ADC_CCR_DUAL) == ADC_MODE_INDEPENDENT)    ||   \
      ((ADC12_COMMON->CCR & ADC_CCR_DUAL) == ADC_DUALMODE_REGSIMULT)  ||   \
      ((ADC12_COMMON->CCR & ADC_CCR_DUAL) == ADC_DUALMODE_INTERL) ))

#define ADC_CLEAR_COMMON_CONTROL_REGISTER(__HANDLE__)                                   \
  CLEAR_BIT(__LL_ADC_COMMON_INSTANCE((__HANDLE__)->Instance)->CCR,  ADC_CCR_PRESC     | \
            ADC_CCR_VBATEN                                                            | \
            ADC_CCR_VREFEN )

/**
  * @brief Set handle instance of the ADC slave associated to the ADC master.
  * @param __HANDLE_MASTER__ ADC master handle.
  * @param __HANDLE_SLAVE__ ADC slave handle.
  * @note if __HANDLE_MASTER__ is the handle of a slave ADC (ADC2) or an independent ADC,
  *          __HANDLE_SLAVE__ instance is set to NULL.
  * @retval None
  */
#define ADC_MULTI_SLAVE(__HANDLE_MASTER__, __HANDLE_SLAVE__)             \
  ((((__HANDLE_MASTER__)->Instance == ADC1))                             \
   ? ((__HANDLE_SLAVE__)->Instance = ADC2)                              \
   : ((__HANDLE_SLAVE__)->Instance = NULL))


/**
  * @brief Verify the ADC instance connected to the battery voltage VBAT.
  * @param __HANDLE__ ADC handle.
  * @retval SET (ADC instance is valid) or RESET (ADC instance is invalid)
  */
#if defined(ADC3)
#define ADC_BATTERY_VOLTAGE_INSTANCE(__HANDLE__)  ((((__HANDLE__)->Instance) == ADC2) ||\
                                                   (((__HANDLE__)->Instance) == ADC3) )
#else
#define ADC_BATTERY_VOLTAGE_INSTANCE(__HANDLE__)  ((((__HANDLE__)->Instance) == ADC2) )
#endif /* ADC3 */

/**
  * @brief Verify the ADC instance connected to the internal voltage reference VREFINT.
  * @param __HANDLE__ ADC handle.
  * @retval SET (ADC instance is valid) or RESET (ADC instance is invalid)
  */
#if defined(ADC3)
#define ADC_VREFINT_INSTANCE(__HANDLE__)  ((((__HANDLE__)->Instance) == ADC1) ||\
                                           (((__HANDLE__)->Instance) == ADC2) ||\
                                           (((__HANDLE__)->Instance) == ADC3) )
#else
#define ADC_VREFINT_INSTANCE(__HANDLE__)  ((((__HANDLE__)->Instance) == ADC1) ||\
                                           (((__HANDLE__)->Instance) == ADC2) )
#endif /* ADC3 */

/**
  * @brief Verify the ADC instance connected to the internal voltage reference VREFPLUS.
  * @param __HANDLE__ ADC handle.
  * @retval SET (ADC instance is valid) or RESET (ADC instance is invalid)
  */
#if defined(ADC3)
#define ADC_VREFPLUS_INSTANCE(__HANDLE__)  ((((__HANDLE__)->Instance) == ADC1) ||\
                                            (((__HANDLE__)->Instance) == ADC2) ||\
                                            (((__HANDLE__)->Instance) == ADC3) )
#else
#define ADC_VREFPLUS_INSTANCE(__HANDLE__)  ((((__HANDLE__)->Instance) == ADC1) ||\
                                            (((__HANDLE__)->Instance) == ADC2) )
#endif /* ADC3 */
/**
  * @brief Verify the ADC instance connected to the internal Vcore.
  * @param __HANDLE__ ADC handle.
  * @retval SET (ADC instance is valid) or RESET (ADC instance is invalid)
  */
/**
  * @brief Verify the ADC instance connected to the internal VDDCore.
  * @param __HANDLE__ ADC handle.
  * @retval SET (ADC instance is valid) or RESET (ADC instance is invalid)
  */
#if defined(ADC3)
#define ADC_VDDCORE_INSTANCE(__HANDLE__)  ((((__HANDLE__)->Instance) == ADC2) ||\
                                           (((__HANDLE__)->Instance) == ADC3) )
#else
#define ADC_VDDCORE_INSTANCE(__HANDLE__)  ((((__HANDLE__)->Instance) == ADC2) )
#endif /* ADC3 */
/**
  * @brief Verify the ADC instance connected to the internal VDDCPU.
  * @param __HANDLE__ ADC handle.
  * @retval SET (ADC instance is valid) or RESET (ADC instance is invalid)
  */
#if defined(ADC3)
#define ADC_VDDCPU_INSTANCE(__HANDLE__)  ((((__HANDLE__)->Instance) == ADC2) ||\
                                          (((__HANDLE__)->Instance) == ADC3) )
#else
#define ADC_VDDCPU_INSTANCE(__HANDLE__)  ((((__HANDLE__)->Instance) == ADC2) )
#endif /* ADC3 */
/**
  * @brief Verify the ADC instance connected to the internal VDDGPU.
  * @param __HANDLE__ ADC handle.
  * @retval SET (ADC instance is valid) or RESET (ADC instance is invalid)
  */
#if defined(ADC3)
#define ADC_VDDGPU_INSTANCE(__HANDLE__)  ((((__HANDLE__)->Instance) == ADC2) ||\
                                          (((__HANDLE__)->Instance) == ADC3) )
#else
#define ADC_VDDGPU_INSTANCE(__HANDLE__)  ((((__HANDLE__)->Instance) == ADC2) )
#endif /* ADC3 */

/**
  * @brief Verify the length of scheduled injected conversions group.
  * @param __LENGTH__ number of programmed conversions.
  * @retval SET (__LENGTH__ is within the maximum number of possible programmable injected conversions) or
  *         RESET (__LENGTH__ is null or too large)
  */
#define IS_ADC_INJECTED_NB_CONV(__LENGTH__) (((__LENGTH__) >= (1U)) && ((__LENGTH__) <= (4U)))

/**
  * @brief Calibration factor value range verification.
  * @param __CALIBRATION_FACTOR__ Calibration factor value.
  * @retval SET (__CALIBRATION_FACTOR__ is within the authorized size) or RESET (__CALIBRATION_FACTOR__ is too large)
  */
#define IS_ADC_CALFACT(__CALIBRATION_FACTOR__) ((__CALIBRATION_FACTOR__) <= (0x1FFU))


/**
  * @brief Verify the ADC channel setting.
  * @param __CHANNEL__ programmed ADC channel.
  * @retval SET (__CHANNEL__ is valid) or RESET (__CHANNEL__ is invalid)
  */
#define IS_ADC_CHANNEL(__CHANNEL__) (((__CHANNEL__) == ADC_CHANNEL_0)           || \
                                     ((__CHANNEL__) == ADC_CHANNEL_1)           || \
                                     ((__CHANNEL__) == ADC_CHANNEL_2)           || \
                                     ((__CHANNEL__) == ADC_CHANNEL_3)           || \
                                     ((__CHANNEL__) == ADC_CHANNEL_4)           || \
                                     ((__CHANNEL__) == ADC_CHANNEL_5)           || \
                                     ((__CHANNEL__) == ADC_CHANNEL_6)           || \
                                     ((__CHANNEL__) == ADC_CHANNEL_7)           || \
                                     ((__CHANNEL__) == ADC_CHANNEL_8)           || \
                                     ((__CHANNEL__) == ADC_CHANNEL_9)           || \
                                     ((__CHANNEL__) == ADC_CHANNEL_10)          || \
                                     ((__CHANNEL__) == ADC_CHANNEL_11)          || \
                                     ((__CHANNEL__) == ADC_CHANNEL_12)          || \
                                     ((__CHANNEL__) == ADC_CHANNEL_13)          || \
                                     ((__CHANNEL__) == ADC_CHANNEL_14)          || \
                                     ((__CHANNEL__) == ADC_CHANNEL_15)          || \
                                     ((__CHANNEL__) == ADC_CHANNEL_16)          || \
                                     ((__CHANNEL__) == ADC_CHANNEL_17)          || \
                                     ((__CHANNEL__) == ADC_CHANNEL_18)          || \
                                     ((__CHANNEL__) == ADC_CHANNEL_19)          || \
                                     ((__CHANNEL__) == ADC_CHANNEL_VBAT)        || \
                                     ((__CHANNEL__) == ADC_CHANNEL_VDDCORE)     || \
                                     ((__CHANNEL__) == ADC_CHANNEL_VDDCPU)      || \
                                     ((__CHANNEL__) == ADC_CHANNEL_VDDGPU)      || \
                                     ((__CHANNEL__) == ADC_CHANNEL_VREFINT)       )

/**
  * @brief Verify the ADC channel differential mode availability.
  * @param __INSTANCE__ ADC instance
  * @param __CHANNEL__ ADC channel
  * @retval SET (__CHANNEL__ is valid) or RESET (__CHANNEL__ is invalid)
  */
#define IS_ADC_DIFF_CHANNEL(__INSTANCE__, __CHANNEL__) \
  ( ( ((__INSTANCE__) == ADC1)                         \
    )?                                                 \
    (((__CHANNEL__) == ADC_CHANNEL_1)  ||             \
     ((__CHANNEL__) == ADC_CHANNEL_2)  ||             \
     ((__CHANNEL__) == ADC_CHANNEL_3)  ||             \
     ((__CHANNEL__) == ADC_CHANNEL_4)  ||             \
     ((__CHANNEL__) == ADC_CHANNEL_5)  ||             \
     ((__CHANNEL__) == ADC_CHANNEL_10) ||             \
     ((__CHANNEL__) == ADC_CHANNEL_11) ||             \
     ((__CHANNEL__) == ADC_CHANNEL_15) ||             \
     ((__CHANNEL__) == ADC_CHANNEL_17)   )            \
    :                                                  \
    (((__CHANNEL__) == ADC_CHANNEL_1)  ||             \
     ((__CHANNEL__) == ADC_CHANNEL_2)  ||             \
     ((__CHANNEL__) == ADC_CHANNEL_3)  ||             \
     ((__CHANNEL__) == ADC_CHANNEL_4)  ||             \
     ((__CHANNEL__) == ADC_CHANNEL_5)  ||             \
     ((__CHANNEL__) == ADC_CHANNEL_10) ||             \
     ((__CHANNEL__) == ADC_CHANNEL_11)   )            \
  )

/**
  * @brief Verify the ADC single-ended input or differential mode setting.
  * @param __SING_DIFF__ programmed channel setting.
  * @retval SET (__SING_DIFF__ is valid) or RESET (__SING_DIFF__ is invalid)
  */
#define IS_ADC_SINGLE_DIFFERENTIAL(__SING_DIFF__) (((__SING_DIFF__) == ADC_SINGLE_ENDED)      || \
                                                   ((__SING_DIFF__) == ADC_DIFFERENTIAL_ENDED)  )


/**
  * @brief Verify the ADC offset sign setting.
  * @param __OFFSET_SIGN__ ADC offset sign.
  * @retval SET (__OFFSET_SIGN__ is valid) or RESET (__OFFSET_SIGN__ is invalid)
  */
#define IS_ADC_OFFSET_SIGN(__OFFSET_SIGN__) (((__OFFSET_SIGN__) == ADC_OFFSET_SIGN_NEGATIVE) || \
                                             ((__OFFSET_SIGN__) == ADC_OFFSET_SIGN_POSITIVE)    )
/**
  * @brief Verify the ADC offset management setting.
  * @param __OFFSET_NUMBER__ ADC offset management.
  * @retval SET (__OFFSET_NUMBER__ is valid) or RESET (__OFFSET_NUMBER__ is invalid)
  */
#define IS_ADC_OFFSET_NUMBER(__OFFSET_NUMBER__) (((__OFFSET_NUMBER__) == ADC_OFFSET_NONE) || \
                                                 ((__OFFSET_NUMBER__) == ADC_OFFSET_1)    || \
                                                 ((__OFFSET_NUMBER__) == ADC_OFFSET_2)    || \
                                                 ((__OFFSET_NUMBER__) == ADC_OFFSET_3)    || \
                                                 ((__OFFSET_NUMBER__) == ADC_OFFSET_4)      )

/**
  * @brief Verify the ADC injected channel setting.
  * @param __CHANNEL__ programmed ADC injected channel.
  * @retval SET (__CHANNEL__ is valid) or RESET (__CHANNEL__ is invalid)
  */
#define IS_ADC_INJECTED_RANK(__CHANNEL__) (((__CHANNEL__) == ADC_INJECTED_RANK_1) || \
                                           ((__CHANNEL__) == ADC_INJECTED_RANK_2) || \
                                           ((__CHANNEL__) == ADC_INJECTED_RANK_3) || \
                                           ((__CHANNEL__) == ADC_INJECTED_RANK_4)   )

/**
  * @brief Verify the ADC injected conversions external trigger.
  * @param __INJ_TRIG_SOURCE__ programmed ADC injected conversions external trigger.
  * @retval SET (__INJ_TRIG_SOURCE__ is a valid value) or RESET (__INJ_TRIG_SOURCE__ is invalid)
  */
#define IS_ADC_EXTTRIGINJEC_ADC12(__INJ_TRIG_SOURCE__)                    \
  (   ((__INJ_TRIG_SOURCE__) == ADC_INJECTED_SOFTWARE_START)              \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T1_TRGO)         \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T1_TRGO2)        \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T8_TRGO)         \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T8_TRGO2)        \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T20_TRGO)        \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T20_TRGO2)       \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T2_TRGO)         \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T3_TRGO)         \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T4_TRGO)         \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T5_TRGO)         \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T6_TRGO)         \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T7_TRGO)         \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T15_TRGO)        \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T16_CC1)         \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T1_CC3_ADC12)    \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T8_CC1)          \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T20_CC1)         \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T2_CC1)          \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T2_CC3)          \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T3_CC1)          \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T4_CC1)          \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T5_CC3)          \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T12_CC1)         \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_EXT_IT15)        \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_LPTIM1_CH2)      \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_LPTIM2_CH2)      \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_LPTIM3_CH1)      \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_LPTIM4_CH1)      \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_LPTIM5_OUT)      \
  )

#define IS_ADC_EXTTRIGINJEC_ADC3(__INJ_TRIG_SOURCE__)                      \
  (   ((__INJ_TRIG_SOURCE__) == ADC_INJECTED_SOFTWARE_START)               \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T1_TRGO)          \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T1_TRGO2)         \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T8_TRGO)          \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T8_TRGO2)         \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T20_TRGO)         \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T20_TRGO2)        \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T2_TRGO)          \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T3_TRGO)          \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T4_TRGO)          \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T5_TRGO)          \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T6_TRGO)          \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T7_TRGO)          \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T15_TRGO)         \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T1_CC3_ADC3)      \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T1_CC4)           \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T8_CC2)           \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T8_CC4)           \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T20_CC2)          \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T4_CC3)           \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T4_CC4)           \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T5_CC1)           \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T12_CC2)          \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_T15_CC1)          \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_EXT_IT3)          \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_LPTIM1_CH2)       \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_LPTIM2_CH2)       \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_LPTIM3_CH1)       \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_LPTIM4_CH1)       \
      || ((__INJ_TRIG_SOURCE__) == ADC_EXTERNALTRIGINJEC_LPTIM5_OUT)       \
  )

#define IS_ADC_EXTTRIGINJEC(__ADC_INSTANCE__, __INJ_TRIG_SOURCE__)          \
  ((((__ADC_INSTANCE__) == ADC1) || ((__ADC_INSTANCE__) == ADC2))           \
   ? IS_ADC_EXTTRIGINJEC_ADC12(__INJ_TRIG_SOURCE__)                        \
   :                                                                     \
   IS_ADC_EXTTRIGINJEC_ADC3(__INJ_TRIG_SOURCE__)                         \
  )


/**
  * @brief Verify the ADC edge trigger setting for injected group.
  * @param __EDGE__ programmed ADC edge trigger setting.
  * @retval SET (__EDGE__ is a valid value) or RESET (__EDGE__ is invalid)
  */
#define IS_ADC_EXTTRIGINJEC_EDGE(__EDGE__) (((__EDGE__) == ADC_EXTERNALTRIGINJECCONV_EDGE_NONE)         || \
                                            ((__EDGE__) == ADC_EXTERNALTRIGINJECCONV_EDGE_RISING)       || \
                                            ((__EDGE__) == ADC_EXTERNALTRIGINJECCONV_EDGE_FALLING)      || \
                                            ((__EDGE__) == ADC_EXTERNALTRIGINJECCONV_EDGE_RISINGFALLING) )

#if defined(ADC_MULTIMODE_SUPPORT)
/**
  * @brief Verify the ADC multimode setting.
  * @param __MODE__ programmed ADC multimode setting.
  * @retval SET (__MODE__ is valid) or RESET (__MODE__ is invalid)
  */
#define IS_ADC_MULTIMODE(__MODE__) (((__MODE__) == ADC_MODE_INDEPENDENT)               || \
                                    ((__MODE__) == ADC_DUALMODE_REGSIMULT_INJECSIMULT) || \
                                    ((__MODE__) == ADC_DUALMODE_REGSIMULT_ALTERTRIG)   || \
                                    ((__MODE__) == ADC_DUALMODE_REGINTERL_INJECSIMULT) || \
                                    ((__MODE__) == ADC_DUALMODE_INJECSIMULT)           || \
                                    ((__MODE__) == ADC_DUALMODE_REGSIMULT)             || \
                                    ((__MODE__) == ADC_DUALMODE_INTERL)                || \
                                    ((__MODE__) == ADC_DUALMODE_ALTERTRIG)               )

/**
  * @brief Verify the ADC dual data mode setting.
  * @param MODE: programmed ADC dual mode setting.
  * @retval SET (MODE is valid) or RESET (MODE is invalid)
  */
#define IS_ADC_DUAL_DATA_MODE(MODE) (((MODE) == ADC_DUALMODEDATAFORMAT_DISABLED) || \
                                     ((MODE) == ADC_DUALMODEDATAFORMAT_32_BIT)   || \
                                     ((MODE) == ADC_DUALMODEDATAFORMAT_8_BIT)      )

/**
  * @brief Verify the ADC multimode delay setting.
  * @param __DELAY__ programmed ADC multimode delay setting.
  * @retval SET (__DELAY__ is a valid value) or RESET (__DELAY__ is invalid)
  */
#define IS_ADC_SAMPLING_DELAY(__DELAY__) (((__DELAY__) == ADC_TWOSAMPLINGDELAY_1CYCLE)   || \
                                          ((__DELAY__) == ADC_TWOSAMPLINGDELAY_2CYCLES)  || \
                                          ((__DELAY__) == ADC_TWOSAMPLINGDELAY_3CYCLES)  || \
                                          ((__DELAY__) == ADC_TWOSAMPLINGDELAY_4CYCLES)  || \
                                          ((__DELAY__) == ADC_TWOSAMPLINGDELAY_5CYCLES)  || \
                                          ((__DELAY__) == ADC_TWOSAMPLINGDELAY_6CYCLES)  || \
                                          ((__DELAY__) == ADC_TWOSAMPLINGDELAY_7CYCLES)  || \
                                          ((__DELAY__) == ADC_TWOSAMPLINGDELAY_8CYCLES)  || \
                                          ((__DELAY__) == ADC_TWOSAMPLINGDELAY_9CYCLES)  || \
                                          ((__DELAY__) == ADC_TWOSAMPLINGDELAY_10CYCLES) || \
                                          ((__DELAY__) == ADC_TWOSAMPLINGDELAY_11CYCLES) || \
                                          ((__DELAY__) == ADC_TWOSAMPLINGDELAY_12CYCLES)   )
#endif /* ADC_MULTIMODE_SUPPORT */

/**
  * @brief Verify the ADC analog watchdog setting.
  * @param __WATCHDOG__ programmed ADC analog watchdog setting.
  * @retval SET (__WATCHDOG__ is valid) or RESET (__WATCHDOG__ is invalid)
  */
#define IS_ADC_ANALOG_WATCHDOG_NUMBER(__WATCHDOG__) (((__WATCHDOG__) == ADC_ANALOGWATCHDOG_1) || \
                                                     ((__WATCHDOG__) == ADC_ANALOGWATCHDOG_2) || \
                                                     ((__WATCHDOG__) == ADC_ANALOGWATCHDOG_3)   )

/**
  * @brief Verify the ADC analog watchdog mode setting.
  * @param __WATCHDOG_MODE__ programmed ADC analog watchdog mode setting.
  * @retval SET (__WATCHDOG_MODE__ is valid) or RESET (__WATCHDOG_MODE__ is invalid)
  */
#define IS_ADC_ANALOG_WATCHDOG_MODE(__WATCHDOG_MODE__) (((__WATCHDOG_MODE__) == ADC_ANALOGWATCHDOG_NONE)           || \
                                                        ((__WATCHDOG_MODE__) == ADC_ANALOGWATCHDOG_SINGLE_REG)     || \
                                                        ((__WATCHDOG_MODE__) == ADC_ANALOGWATCHDOG_SINGLE_INJEC)   || \
                                                        ((__WATCHDOG_MODE__) == ADC_ANALOGWATCHDOG_SINGLE_REGINJEC)|| \
                                                        ((__WATCHDOG_MODE__) == ADC_ANALOGWATCHDOG_ALL_REG)        || \
                                                        ((__WATCHDOG_MODE__) == ADC_ANALOGWATCHDOG_ALL_INJEC)      || \
                                                        ((__WATCHDOG_MODE__) == ADC_ANALOGWATCHDOG_ALL_REGINJEC)     )

/**
  * @brief Verify the ADC analog watchdog filtering setting.
  * @param __FILTERING_MODE__ programmed ADC analog watchdog mode setting.
  * @retval SET (__FILTERING_MODE__ is valid) or RESET (__FILTERING_MODE__ is invalid)
  */
#define IS_ADC_ANALOG_WATCHDOG_FILTERING_MODE(__FILTERING_MODE__)  \
  (((__FILTERING_MODE__) == ADC_AWD_FILTERING_NONE)     ||   \
   ((__FILTERING_MODE__) == ADC_AWD_FILTERING_2SAMPLES)  ||   \
   ((__FILTERING_MODE__) == ADC_AWD_FILTERING_3SAMPLES)  ||   \
   ((__FILTERING_MODE__) == ADC_AWD_FILTERING_4SAMPLES)  ||   \
   ((__FILTERING_MODE__) == ADC_AWD_FILTERING_5SAMPLES)  ||   \
   ((__FILTERING_MODE__) == ADC_AWD_FILTERING_6SAMPLES)  ||   \
   ((__FILTERING_MODE__) == ADC_AWD_FILTERING_7SAMPLES)  ||   \
   ((__FILTERING_MODE__) == ADC_AWD_FILTERING_8SAMPLES)    )


/**
  * @brief Verify the ADC conversion (regular or injected or both).
  * @param __CONVERSION__ ADC conversion group.
  * @retval SET (__CONVERSION__ is valid) or RESET (__CONVERSION__ is invalid)
  */
#define IS_ADC_CONVERSION_GROUP(__CONVERSION__) (((__CONVERSION__) == ADC_REGULAR_GROUP)         || \
                                                 ((__CONVERSION__) == ADC_INJECTED_GROUP)        || \
                                                 ((__CONVERSION__) == ADC_REGULAR_INJECTED_GROUP)  )

/**
  * @brief Verify the ADC event type.
  * @param __EVENT__ ADC event.
  * @retval SET (__EVENT__ is valid) or RESET (__EVENT__ is invalid)
  */
#define IS_ADC_EVENT_TYPE(__EVENT__) (((__EVENT__) == ADC_EOSMP_EVENT)  || \
                                      ((__EVENT__) == ADC_AWD_EVENT)    || \
                                      ((__EVENT__) == ADC_AWD2_EVENT)   || \
                                      ((__EVENT__) == ADC_AWD3_EVENT)   || \
                                      ((__EVENT__) == ADC_OVR_EVENT)  )

/**
  * @brief Verify the ADC oversampling ratio.
  * @param __RATIO__: programmed ADC oversampling ratio.
  * @retval SET (__RATIO__ is a valid value) or RESET (__RATIO__ is invalid)
  */
#define IS_ADC_OVERSAMPLING_RATIO(__RATIO__)  (((__RATIO__) >= 1UL) && ((__RATIO__) <= 1024UL))

